{
    "name": "2025年上海市中考语文真题（网络回忆版）",
    "province": "上海",
    "grade": "九年级",
    "year": 2025,
    "subject": "语文",
    "stemlist": [
        {
            "origin": "2025·上海·中考真题",
            "stem": "1. 默写与运用。（1）造化钟神秀，______________________。（杜甫《望岳》）（2）山气日夕佳，______________________。（陶渊明《饮酒（其五）》）（3）______________________，听取蛙声一片。（辛弃疾《西江月·夜行黄沙道中》）（4）小申同学在阅读时明白，作为当代的中国青年需要心怀家国，以天下为己任的人生目标，正如范仲淹在《岳阳楼记》中所写的那样“______________________，______________________。”",
            "origin_from_our_bank": [
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "2022年上海市徐汇区中考一模语文试题"
                ],
                [
                    "上海市黄浦区2023-2024学年九年级上学期期末（暨中考一模）语文试题"
                ],
                [
                    "2020年新疆塔城地区乌苏市中考二模语文试题"
                ]
            ]
        },
        {
            "origin": "2025·上海·中考真题",
            "stem": "阅读下面文章，完成小题。甲陋室铭山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？乙①起首四句，兴起室以德重意。“惟吾德馨”一语，道尽陋室增光处，最为简要。以下皆言吾德之能使陋室馨也，是故苔痕草色，无非吾德生意；谈笑往来，无非吾德应酬、调琴无丝竹乱耳；阅经无案牍劳形，愈不问而知为吾德举动矣。吾德之能使陋室馨者如是②，虽以是室比诸葛草庐、子云玄亭，无多让焉，末引“何陋”作结，而诵法③孔子，其德又何可量耶？【注释】①本文选自清余诚《重订古文释义新编·卷七》，乙文是对甲文的点评。②如是：不如，比不上。③诵法：效仿。2．甲文的作者是________________。3．为两文的加点字选择最合适的解释。（1）可以调素琴(     )A.白色的B.不加装饰的C.质朴的D.向来的（2）道尽陋室增光处(     )A.主张B.说C.道路D.学派4．下面加点词的用法与“无丝竹之乱耳”中“乱”用法一致的是（）A．山不在高B．斯是陋室C．往来无白丁D．无案牍之劳形5．用现代汉语翻译甲文画线句。何陋之有？6．下面最能概括甲文陋室主人品质的诗句是（）A．舍生而取义者也。B．人不知而不愠，不亦君子乎？C．博学而笃志，切问而近思，仁在其中矣。D．一箪食，一瓢饮，在陋巷，人不堪其忧，回也不改其乐。7．下面对乙文三句画波浪线句理解正确的一项是（）A．说明甲文声韵和谐B．说明甲文结构严谨C．说明甲文语言浅白平实D．说明甲文比喻巧妙8．结合乙文画直线的句子，分析乙文对陋室主人德行的评价。",
            "origin_from_our_bank": [
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "广东省肇庆市第八中学2017——2018学年七年级第二学期第二次段考下册语文试题"
                ],
                [
                    "陕西省西安市阎良区2020-2021学年七年级下学期期末语文试题"
                ],
                [
                    "湖北省十堰市郧西县2018-2019学年八年级下学期3月月考语文试题"
                ],
                [
                    "黑龙江省哈尔滨市阿城区2022-2023学年七年级下学期期末语文试题"
                ]
            ]
        },
        {
            "origin": "2025·上海·中考真题",
            "stem": "阅读下面文章，完成小题。春江水暖鸭先知①福广老汉瞅着这两只多出来的麻鸭有点不舒服。②麻鸭是儿子陈玉禾带回来的，他在县农委上班，最近在搞什么农业项目试点申报，忙得脚不落地，好久没回村了，前几天却开车回来把这两只捆住脚的鸭往院子里一扔，连晚饭都没在家吃就又回去了。“爸，这两只鸭你先养几天！”临走，就撂下这么句话。福广老汉无奈，只好把这两只鸭和自家的一群大白鹅一起养，可不敢下水，不关几天认认家，这生鸭一下水，一不留神可就躲到芦苇荡去了。③但是，老这么关着也不是个事，他是老行家，晓得鹅鸭得放养，在草里跑跑，在水里游游，啄啄螺蛳，吃点鱼虾，比什么都强。这家禽和人一样，得经常放放风，心情好了，就长得好。上回听玉禾说，这国外养牛都放音乐了，听什么莫扎特，也是一个道理。这样想着，过了几天，他就把两只鸭放了脚，赶往村外的河汉。两只麻鸭在鹅群里并不显慌乱，紧跟着大部队嘎嘎叫着，一步一歪，兴奋得像出征的大将军似的——看来已经认家合群了。④河汉宽阔如江，河滩芦苇飘飘，早春时节，水温正好。村头的福胜老汉早已赶着一群麻鸭过来了。两家其实早先算是一族，不过已经出了五服，前些年因为田地的事情吵过一次，虽说事情没闹大，但农村人性子犟脾气直，谁也拉不下面子低头，也就没了往来。⑤福胜老汉冷不丁瞅见福广老汉鹅群里的两只鸭，尤其是和自家鸭子身上一样的麻纹， 心里不由咯噔了一下，这不是前些日子走丢的那两只吗？难道是被福广这个不要脸的老家伙给捡回家了？也不晓得归还？不对，福广不是这样的人，虽说这几年有点小疙瘩，但是自小一起长大的，这家伙不是这种偷鸡摸狗的人，是不是我看错了？福胜老汉远远看着福广老汉赶着鹅群下了河滩，有心想问，又有点犹豫。⑥福广老汉也在河滩边寻思，儿子拿回来的这两只鸭，看着品种和福胜家差不多。难道是今年县里推出的新品种？这几年沾了儿子在县农委的光，有什么新的家禽品种都可以先试养，这些品种经过科学筛选，非常适合推广养殖，这不他家养的大白鹅就是新品种，生长快，耐粗饲，肉质好，产蛋多，养了两年，确实跟着发了一点小财。看来，福胜这次倒是走到前面去了。⑦福胜老汉还是不除疑。他甩了甩随身带的竹鞭，想着试上一试。他将鸭群慢慢赶到鹅群附近，然后打了个响鞭，唿哨几声——这是往常赶着鸭群回家的信号。鸭群听到熟悉的指令后，开始慢慢游上岸，向自己身边聚拢。果不其然，福广家鹅群里的两只鸭，似乎也习惯性地跟着游了过来，走近一看，福胜更加断定就是自家丢了的那两只麻鸭。⑧福广老汉迎上福胜老汉质疑的目光，有点愕然，更带着点气愤说：“福胜，你这是啥意思？”福胜老汉讥笑道：“还好意思问我，我问你，这两只鸭哪来的？怎么一听我招呼，就和我家鸭合群了？”福广老汉不甘示弱说：“这是我儿子玉禾带回来试养的新鸭种，怎么，难不成是偷你家的？！”眼看着就要吵起来。⑨远处来了两个人，有说有笑的。福胜老汉定睛一看，这不是儿子陈玉江和福广家的陈玉禾吗？他们什么时候这么要好了？见小辈来了，两个老汉气鼓鼓地停住了嘴。⑩陈玉禾到河边一看，心里了然，说：“爸，前几天带回的麻鸭您已经还给胜伯了啊？这是玉江家引进的新品种，肉质好，还能生双黄蛋，已经通过县里的推广审核了！”他故意略过那天回来没说是谁家的鸭，就是怕他心里不舒服，更是想着借机让两家和好。陈玉江也不好意思地说：“爸，我怕您反对就没说把麻鸭带去请玉禾哥帮忙，看能不能申请新品种推广，这样咱家以后就可以专门提供鸭苗了！”他没好意思说，他是故意把两只鸭扔在了玉禾那里，让他尝尝鲜吃了嘴短，没想到玉禾不但热心帮忙，还专门为这事跑回来两趟，心里很是惭愧。⑪一阵春风拂过，阳光拱开厚厚的云衣，河边福广老汉和福胜老汉的影子被拉得斜长，像是靠在了一起。两家的鹅鸭没听到指令，又慢悠悠下到温暖的河水里，合群在一起西钻东啄找起食来……9．下图是对本文人物关系的梳理，下面填写正确的（）A．①同事②父子B．①父子②远亲C．①朋友②同学D．①同学②远亲10．第①段中“福广老汉看着那两只多出来的麻鸭有点别扭”的原因有：（1）__________________；（2）__________________。11．分析第⑤段心理描写在情节上的作用。12．本文第⑪段的描写富有画面感，请赏析其妙处。",
            "origin_from_our_bank": [
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "湖南省衡阳市八中教育集团2025-2026学年九年级上学期入学考试语文试卷"
                ],
                [
                    "广东省茂名市博雅中学2024-2025学年九年级上学期第一次月考语文试题"
                ],
                [
                    "专题14：小说阅读-2022-2023学年八年级语文下学期期末考点大串讲（部编版）",
                    "湖南省怀化市会同县2021-2022学年八年级下学期期末语文试题",
                    "浙江省金华市婺城区2020-2021学年八年级下学期期末语文试题"
                ],
                [
                    "河南省西华县2021-2022学年八年级下学期期末语文考试题"
                ]
            ]
        },
        {
            "origin": "2025·上海·中考真题",
            "stem": "阅读下面材料，完成小题。材料一：美国博物馆向我归还流失近80年的楚帛书①新华社华盛顿5月16日电当地时间5月16日，国家文物局在中国驻美国大使馆接收美国史密森学会国立亚洲艺术博物馆返还的子弹库帛书《五行令》《攻守占》。文化和旅游部副部长、国家文物局局长饶权在视频致辞中指出，美国史密森学会国立亚洲艺术博物馆向中方返还帛书《五行令》《攻守占》，彰显其在文化遗产保护合作中恪守博物馆伦理的努力，是中国主导制定的《青岛建议书》以对话与合作推动历史上流失文物保护与返还理念的成功实践。帛书回归后，将在文物原生环境中得到更加全面、系统保护和研究，让文物价值得到更加准确、完整理解和阐释。②子弹库帛书1942年出土于长沙子弹库楚墓，是目前出土的唯一战国帛书，_______是迄今发现的中国最早的帛书和首个典籍意义上的古书，对于中国古文字、古文献研究以及学术史、思想史研究具有不可替代的重要价值。子弹库帛书分三卷，此次回归的《五行令》和《攻守占》为子弹库帛书第二卷、第三卷。③子弹库帛书1946年非法流失美国。第一时间关注到美国史密森学会发布了关于返还非道德方式获取文物的政策性文件后，国家文物局对国立亚洲艺术博物馆保存的子弹库帛书《五行令》《攻守占》启动了追索工作。基于溯源及流转历史研究形成的扎实、完整证据链，基于以文物回归纠正历史错误、推动双方在专业领域的长期合作这一共识经过多轮磋商，美方同意将文物退出馆藏并返还中国。④子弹库帛书《五行令》《攻守占》回归祖国，成为主动追索历史上流失重点文物并取得成功的案例，也是秉持《青岛建议书》对话与合作的核心精神，以溯源及流转历史研究成果为支撑，实现流失海外中国文物追索成功的示范案例。《五行令》《攻守占》将于2025年7月在中国国家博物馆举办的“万里同归——新时代文物追索返还成果展”上首次面向公众展出。国家文物局将继续推动子弹库帛书《四时令》早日回归。（选自《解放日报》2025年5月17日刊，有删改）材料二：国宝战国帛书回家①5月18日3时55分，北京首都国际机场，从美国华盛顿飞来的CA818航班划过晨雾，稳稳降落在跑道上。机上的大部分乘客并不知道，流失美国长达79年的珍贵文物—子弹库帛书《五行令》《攻守占》，就存放在工作组人员身旁的4个文物包装箱中。②美国时间5月16日，国家文物局在中国驻美国大使馆接收了美国史密森尼学会国立亚洲艺术博物馆返还的子弹库帛书《五行令》《攻守占》。经过查验封箱后，国家文物局工作组马不停蹄，带着它们踏上了回家的路。③子弹库帛书是目前出土的唯一的战国帛书。帛书分为《四时令》《五行令》《攻守占》三卷，字数多达900余字，是迄今为止发现的中国最早的帛书和首个典籍意义上的古书。同西方世界大名鼎鼎的“死海文书”相比，子弹库帛书的年代还要早100多年。④跨越11000多公里，飞行16个多小时，帛书归来，断章重续。⑤4时45分，准备妥当后，4名工作人员每人手捧一件文物包装箱，缓步离开机舱。5时06分，文物抵达要客区，安放在铺有软垫的桌子上。海关人员查验完报关单后，工作人员小心翼翼开启了装有月名图的包装箱封条。⑥5时27分，文物整装待发，披着东方的晨雾踏上归国之路。（选自《文汇报》2025年5月18日刊，有删改）13．下面最适合填写在材料一横线处的一项是（）A．只B．但C．也D．才14．作为一则新闻，下面对材料一分析不正确的一项是（）A．在新闻事件后第一时间发出，具有很强的时效性。B．按照时间顺序说明了子弹库帛书流失、追索过程。C．导语部分点明了新闻发生的时间、地点与事件。D．新闻的重要性逐层递进，符合新闻的价值。15．新闻的编写需要具有读者意识，材料二符合读者需求的一项是（）A．了解不同人物对子弹库帛书回归的看法差异。B．明确掌握子弹库帛书回归的价值与背景信息。C．了解子弹库帛书的机场运输过程与转运细节。D．深入探究艺术博物馆的建馆历史与发展历程。16．材料一、材料二均为报道子弹库帛书回归这一事件的新闻，但语言特点不同：材料一：____________________________；材料二：____________________________。",
            "origin_from_our_bank": [
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "学易金卷：八年级语文上学期期中模拟卷（青岛专用）"
                ],
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "辽宁省大连市西岗区2024-2025学年八年级下学期期末语文试题"
                ],
                [
                    "辽宁省大连市中山区2024-2025学年七年级下学期期末语文试题"
                ]
            ]
        },
        {
            "origin": "2025·上海·中考真题",
            "stem": "阅读下面材料，完成小题。材料一：美国博物馆向我归还流失近80年的楚帛书①新华社华盛顿5月16日电当地时间5月16日，国家文物局在中国驻美国大使馆接收美国史密森学会国立亚洲艺术博物馆返还的子弹库帛书《五行令》《攻守占》。文化和旅游部副部长、国家文物局局长饶权在视频致辞中指出，美国史密森学会国立亚洲艺术博物馆向中方返还帛书《五行令》《攻守占》，彰显其在文化遗产保护合作中恪守博物馆伦理的努力，是中国主导制定的《青岛建议书》以对话与合作推动历史上流失文物保护与返还理念的成功实践。帛书回归后，将在文物原生环境中得到更加全面、系统保护和研究，让文物价值得到更加准确、完整理解和阐释。②子弹库帛书1942年出土于长沙子弹库楚墓，是目前出土的唯一战国帛书，_______是迄今发现的中国最早的帛书和首个典籍意义上的古书，对于中国古文字、古文献研究以及学术史、思想史研究具有不可替代的重要价值。子弹库帛书分三卷，此次回归的《五行令》和《攻守占》为子弹库帛书第二卷、第三卷。③子弹库帛书1946年非法流失美国。第一时间关注到美国史密森学会发布了关于返还非道德方式获取文物的政策性文件后，国家文物局对国立亚洲艺术博物馆保存的子弹库帛书《五行令》《攻守占》启动了追索工作。基于溯源及流转历史研究形成的扎实、完整证据链，基于以文物回归纠正历史错误、推动双方在专业领域的长期合作这一共识经过多轮磋商，美方同意将文物退出馆藏并返还中国。④子弹库帛书《五行令》《攻守占》回归祖国，成为主动追索历史上流失重点文物并取得成功的案例，也是秉持《青岛建议书》对话与合作的核心精神，以溯源及流转历史研究成果为支撑，实现流失海外中国文物追索成功的示范案例。《五行令》《攻守占》将于2025年7月在中国国家博物馆举办的“万里同归——新时代文物追索返还成果展”上首次面向公众展出。国家文物局将继续推动子弹库帛书《四时令》早日回归。（选自《解放日报》2025年5月17日刊，有删改）材料二：国宝战国帛书回家①5月18日3时55分，北京首都国际机场，从美国华盛顿飞来的CA818航班划过晨雾，稳稳降落在跑道上。机上的大部分乘客并不知道，流失美国长达79年的珍贵文物—子弹库帛书《五行令》《攻守占》，就存放在工作组人员身旁的4个文物包装箱中。②美国时间5月16日，国家文物局在中国驻美国大使馆接收了美国史密森尼学会国立亚洲艺术博物馆返还的子弹库帛书《五行令》《攻守占》。经过查验封箱后，国家文物局工作组马不停蹄，带着它们踏上了回家的路。③子弹库帛书是目前出土的唯一的战国帛书。帛书分为《四时令》《五行令》《攻守占》三卷，字数多达900余字，是迄今为止发现的中国最早的帛书和首个典籍意义上的古书。同西方世界大名鼎鼎的“死海文书”相比，子弹库帛书的年代还要早100多年。④跨越11000多公里，飞行16个多小时，帛书归来，断章重续。⑤4时45分，准备妥当后，4名工作人员每人手捧一件文物包装箱，缓步离开机舱。5时06分，文物抵达要客区，安放在铺有软垫的桌子上。海关人员查验完报关单后，工作人员小心翼翼开启了装有月名图的包装箱封条。⑥5时27分，文物整装待发，披着东方的晨雾踏上归国之路。（选自《文汇报》2025年5月18日刊，有删改）读完两则新闻报道后，小申所在的语文小组对这一新闻事件展开深入探究，了解相关知识，追溯子弹库帛书自出土以来的历史流转脉络，剖析其流失海外的历史背景与回归意义，请你帮助他们完成下面任务。17．为了了解“子弹库帛书”的主题，下面最适合的资料是（）A．文物修复的实用技巧B．古籍图本解析C．文物见闻所记D．子弹库帛书研究者的生平18．小申查阅了相关资料，下列对子弹库帛书流转和回归过程的排序正确的一项是（）①一举美国人以照相为由，向蔡季襄强得楚帛书，后托人将它带到了美国。②子弹库的这件帛书是前所未有的新奇宝贝。很快，它成了蔡季襄的藏品。③在长沙城东南郊子弹库，四个盗墓者打开一座战国古墓，发现了楚帛书。④5月18日3时55分，子弹库伯书终于回归。A．②④①③B．①③④②C．③①④②D．③②①④",
            "origin_from_our_bank": [
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "学易金卷：八年级语文上学期期中模拟卷（青岛专用）"
                ],
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "辽宁省大连市西岗区2024-2025学年八年级下学期期末语文试题"
                ],
                [
                    "辽宁省大连市中山区2024-2025学年七年级下学期期末语文试题"
                ]
            ]
        },
        {
            "origin": "2025·上海·中考真题",
            "stem": "19. 阅读下面材料，根据要求完成归纳。小申为了了解“帛”与古代文体的关系，查阅了《经典常谈》中的《说文解字·第一》，读到原文中写道：“‘帛，缯也。从巾白声。凡帛之屬皆从帛。’许慎认为‘帛’是形声字，从巾旁，表其与丝织品相关；白声，古音在五部。‘缯’在古代也是丝织品的意思，因而‘帛’本义指丝织品的总称，竹木简、帛、纸，都容易坏，汉以前的，已经荡然无存了。”在古代，帛不仅作为一种贵重的织物，还常被用于书写，有了‘帛书’一说，像子弹库帛书便是书写在帛上的珍贵古籍。然而同时同小组的同学又了解到，其实在商周时期就有关于“帛”的记载：“帛，今之璧色缯也。诸侯世子执纁，公之孤执玄，附庸之君执黄。”这似乎与《经典常谈》中的描述不符。后来大家了解到，《经典常谈》一书写于1938年至1942年间（抗日战争时期），曾经有一位学者这样说：“我从未有过丝毫自满，在研究领域，我始终坚定地认为，必须得到准确无误的结论。这一追求，驱使我不断前行，研究之路，永无止境。”原来，朱自清先生的描述也并非完全正确。请写出在小申的探究过程中你得到启发与感悟：（要求：每点不超过20字）（1）__________________；（2）__________________；（3）__________________。",
            "origin_from_our_bank": [
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "2021年吉林省长春市二道区中考一模语文试题"
                ],
                [
                    "江苏省扬州市梅岭集团2024-2025学年八年级下学期期中语文试题"
                ],
                [
                    "江苏省无锡市积余教育集团2024-2025学年八年级下学期期中语文试题"
                ]
            ]
        },
        {
            "origin": "2025·上海·中考真题",
            "stem": "20. 了解相关信息后，小申创作了诗歌表达对子弹库帛书回归这一事件的心情，请分析修改稿较原稿的精妙之处。归来（原稿）归来（修改稿）曾经你在幽暗的山顶哭泣，我于历史的幽径中找寻，在泛黄岁月的黯淡光影里，我在等风也等你。如今你跨越重洋归来，带着岁月斑驳的痕迹，我在浪潮中澎湃难平。在曙光初照的温暖怀抱中，我热泪盈眶终于等到你。曾经，你在异国蒙尘，在幽暗的山顶哭泣，我于历史的幽径中找寻，在泛黄岁月的黯淡光影里，满心怅惘，盼你昭和。等风也等你。如今，你跨越重洋归来，带着岁月斑驳的痕迹，我在浪潮中澎湃难平。在曙光初照的温暖怀抱中，热泪盈眶，迎你归根，终于等到你。",
            "origin_from_our_bank": [
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "2025年重庆市綦江区联盟校中考一模语文试题"
                ],
                [
                    "辽宁省大连市沙河口区2023-2024学年八年级下学期期末语文试题"
                ],
                [
                    "专题06 记叙文阅读（四大主旨）-【好题汇编】备战2023-2024学年八年级语文上学期期末真题分类汇编（江苏专用）",
                    "江苏省南通市崇川区2022-2023学年八年级上学期期末语文试题",
                    "江苏省泗阳桃州中学2023-2024学年八年级上学期第一次月考语文试题"
                ]
            ]
        },
        {
            "origin": "2025·上海·中考真题",
            "stem": "21.《现代汉语词典》对“成全”的解释是：“帮助人，使达到目的。”请以“相互成全”为题，写一篇600字左右的文章。要求：（1）不得透露个人相关信息；（2）不得抄袭。",
            "origin_from_our_bank": [
                [
                    "2025年上海市中考语文真题"
                ],
                [
                    "上海市宝山区2021-2022学年九下学期期中语文试题"
                ],
                [
                    "【智】4  2025年全国中考真题优选重组卷（二）  "
                ],
                [
                    "上海市嘉定区2021-2022学年八年级（五四学制）上学期期中语文试题",
                    "上海市浦东新区22校联考2023-2024学年八年级上学期期中语文试题"
                ],
                [
                    "上海市崇明区2023-2024学年九年级上学期期末（暨中考一模）语文试题"
                ]
            ]
        }
    ]
}